[
    {
        "id": 1,
        "description": "Declara variables de diferentes tipos y asigna valores. Declara una variable int llamada edad y asígnale el valor 25. Declara una variable double llamada altura y asígnale el valor 1.75. Declara una variable String llamada nombre y asígnale tu nombre. Declara una variable boolean llamada esEstudiante y asígnale true. Imprime todas las variables por consola.",
        "solution": "src/main/java/com/example/Ejercicio1.java"
    },
    {
        "id": 2,
        "description": "Trabaja con todos los tipos de datos primitivos de Java. Declara una variable byte con valor 100. Declara una variable short con valor 1000. Declara una variable int con valor 50000. Declara una variable long con valor 1000000L. Declara una variable float con valor 3.14f. Declara una variable double con valor 2.71828. Declara una variable char con valor 'A'. Declara una variable boolean con valor false. Imprime cada variable mostrando su tipo y valor.",
        "solution": "src/main/java/com/example/Ejercicio2.java"
    },
    {
        "id": 3,
        "description": "Practica el uso correcto de identificadores siguiendo lowerCamelCase. Declara una variable llamada numeroDeEstudiantes con valor 30. Declara una variable llamada promedioCalificaciones con valor 8.5. Declara una variable llamada nombreCompleto con tu nombre completo. Declara una variable llamada esMayorDeEdad con valor true. Agrega comentarios explicando por qué estos nombres son válidos. Imprime todas las variables.",
        "solution": "src/main/java/com/example/Ejercicio3.java"
    },
    {
        "id": 4,
        "description": "Declara y utiliza constantes con la palabra clave final. Declara una constante final double PI con valor 3.14159. Declara una constante final int DIAS_SEMANA con valor 7. Declara una constante final String NOMBRE_UNIVERSIDAD con el nombre de tu universidad. Calcula el área de un círculo usando PI y radio 5. Imprime las constantes y el resultado del cálculo.",
        "solution": "src/main/java/com/example/Ejercicio4.java"
    },
    {
        "id": 5,
        "description": "Utiliza diferentes métodos para mostrar información en consola. Usa System.out.print() para imprimir \"Hola\" sin salto de línea. Usa System.out.println() para imprimir \" Mundo\" con salto de línea. Usa System.out.printf() para imprimir \"Mi edad es %d años\", usando una variable edad. Imprime una línea separadora usando println().",
        "solution": "src/main/java/com/example/Ejercicio5.java"
    },
    {
        "id": 6,
        "description": "Captura información del usuario usando Scanner. Importa la clase Scanner (import java.util.Scanner;). Crea un objeto Scanner: Scanner scanner = new Scanner(System.in);. Solicita al usuario su nombre y guárdalo en una variable String. Solicita al usuario su edad y guárdala en una variable int. Solicita al usuario su altura y guárdala en una variable double. Imprime todos los datos capturados. Cierra el Scanner con scanner.close().",
        "solution": "src/main/java/com/example/Ejercicio6.java"
    },
    {
        "id": 7,
        "description": "Practica diferentes formas de unir cadenas de texto. Declara String nombre = \"Juan\" y String apellido = \"Pérez\". Concatena usando el operador +: String nombreCompleto = nombre + \" \" + apellido. Concatena usando concat(): String saludo = \"Hola \".concat(nombreCompleto). Declara int edad = 20 y concatena: \"Tengo \" + edad + \" años\". Imprime todos los resultados mostrando las diferentes técnicas de concatenación.",
        "solution": "src/main/java/com/example/Ejercicio7.java"
    },
    {
        "id": 8,
        "description": "Demuestra el uso correcto de identificadores en Java. Declara variables con nombres válidos: miVariable, _contador, $precio, variable123. En comentarios, explica por qué son válidos (empiezan con letra, guión bajo o $, pueden contener números). En comentarios, lista nombres inválidos: 123variable, mi-variable, class, public. En comentarios, explica por qué son inválidos (empiezan con número, contienen guión, son palabras reservadas). Imprime las variables válidas.",
        "solution": "src/main/java/com/example/Ejercicio8.java"
    },
    {
        "id": 9,
        "description": "Aplica lowerCamelCase en nombres descriptivos y largos. Declara: int numeroDeEstudiantesEnLaClase = 25. Declara: double promedioDeCalificacionesDelSemestre = 8.7. Declara: String nombreCompletoDelProfesor = \"Dr. García\". Declara: boolean estudianteEstaAprobado = true. Imprime todas las variables con mensajes descriptivos que expliquen el uso de lowerCamelCase.",
        "solution": "src/main/java/com/example/Ejercicio9.java"
    },
    {
        "id": 10,
        "description": "Combina todos los temas en un programa completo de facturación. Declara constantes: final double PRECIO_PRODUCTO = 15.99, final int IVA_PORCENTAJE = 16. Captura del usuario usando Scanner: cantidad de productos (int) y nombre del cliente (String). Calcula: subtotal = PRECIO_PRODUCTO * cantidad. Calcula: iva = subtotal * IVA_PORCENTAJE / 100. Calcula: total = subtotal + iva. Imprime factura completa usando concatenación de cadenas. Usa lowerCamelCase en todas las variables. Cierra el Scanner.",
        "solution": "src/main/java/com/example/Ejercicio10.java"
    }
]